Tekla.Structures.Model.PointCloudDataServices.TCPointCloud
Represents a point cloud in Trimble Connect project with metadata such as ID, name, file size, point count, and uploader information.
The following example shows how to use the Tekla.Structures.Model.PointCloudDataServices.PointCloudDataServices class to retrieve point cloud data in Trimble Connect projects
and attach it to a model.
using System.Threading;
using Tekla.Structures.Model;
public class Example
{
public async void Example1()
{
var projects = await PointCloudDataServices.GetProjectsWithPointCloudsAsync();
var pointClouds = projects.First().PointClouds;
var url = await PointCloudDataServices.GetPointCloudUrlAsync(projects.First(), pointClouds.First());
PointCloud pointCloud = new PointCloud
{
Name = pointClouds.First().Name,
Url = url,
TcProjectId = projects.First().Id,
TcPointCloudGuid = pointClouds.First().Id,
LocationBy = Guid.Empty,
UseAutoCreatedBasePoint = true,
Scale = 1.0
};
pointCloud.Attach();
}
}

Tekla.Structures.Model.PointCloudDataServices.TCPointCloud.Id
Unique identifier of the point cloud.

Tekla.Structures.Model.PointCloudDataServices.TCPointCloud.Name
Name of the point cloud.

Tekla.Structures.Model.PointCloudDataServices.TCPointCloud.FileSize
File size of the point cloud in bytes.

Tekla.Structures.Model.PointCloudDataServices.TCPointCloud.PointCount
Number of points in the point cloud.

Tekla.Structures.Model.PointCloudDataServices.TCPointCloud.UploadedBy
Name of the user who uploaded the point cloud.

Tekla.Structures.Model.PointCloudDataServices.TCPointCloud.UploadedDate
Date when the point cloud was uploaded.